stbenn/nuttx/arch/arm/src/stm32h5/stm32h56x_7x_rcc.c
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32h5_rcc_enableperipherals
 ****************************************************************************/

void stm32h5_rcc_enableperipherals(void)
{
  rcc_enableccip();
  rcc_enableahb1();
  rcc_enableahb2();
  rcc_enableahb4();
  rcc_enableapb1l();
  rcc_enableapb1h();
  rcc_enableapb2();
  rcc_enableapb3();

#ifdef STM32H5_USE_HSI48
  /* Enable HSI48 clocking to support USB transfers or RNG */
  stm32h5_enable_hsi48(STM32L4_HSI48_SYNCSRC);
#endif

}

/****************************************************************************
 * Name: stm32h5_stdclockconfig
 *
 * Description:
 *   Called to change to new clock based on settings in board.h
 *
 *   NOTE:  This logic would need to be extended if you need to select low-
 *   power clocking modes!
 ****************************************************************************/

#ifndef CONFIG_ARCH_BOARD_STM32H5_CUSTOM_CLOCKCONFIG
void stm32h5_stdclockconfig(void)
{
  uint32_t regval;
  volatile int32_t timeout;

#if defined(STM32H5_BOARD_USEHSI)
  /* Enable Internal High-Speed Clock (HSI) */

  regval  = getreg32(STM32H5_RCC_CR);
  regval |= RCC_CR_HSION;           /* Enable HSI */
 
#if defined(STMT32H5_CR_HSIDIV) 
  regval |= STM32H5_CR_HSIDIV;
#else
  /* Use default (32 MHz) */
#endif

  putreg32(regval, STM32H5_RCC_CR);

  /* Wait until the HSI is ready (or until a timeout elapsed) */

  for (timeout = HSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the HSIRDY flag is the set in the CR */

      if ((getreg32(STM32H5_RCC_CR) & RCC_CR_HSIRDY) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }

  /* Make sure HSIDIVF is also not 0 */

  for (timeout = HSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the HSIRDY flag is the set in the CR */

      if ((getreg32(STM32H5_RCC_CR) & RCC_CR_HSIDIVF) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }
#endif

#if defined(STM32H5_BOARD_USEHSI)
  /* Already set above */

#elif defined(STM32H5_BOARD_USECSI)
  /* Enable Internal Low Power Internal Clock (CSI) */

  /* Wait until the CSI is either off or ready (or until a timeout elapsed) */

  for (timeout = CSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      if ((regval = getreg32(STM32H5_RCC_CR)),
          (regval & RCC_CR_CSIRDY) || ~(regval & RCC_CR_CSION))
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }

  regval  = getreg32(STM32H5_RCC_CR);
  regval |= RCC_CR_CSION;    /* Enable CSI */
  putreg32(regval, STM32H5_RCC_CR);

  /* Wait until the CSI is ready (or until a timeout elapsed) */

  for (timeout = CSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the CSIRDY flag is the set in the CR */

      if ((getreg32(STM32H5_RCC_CR) & RCC_CR_CSIRDY) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }

#elif defined(STM32H5_BOARD_USEHSE)
  /* Enable External High-Speed Clock (HSE) */

  regval  = getreg32(STM32H5_RCC_CR);
  regval |= RCC_CR_HSEON;           /* Enable HSE */
  putreg32(regval, STM32H5_RCC_CR);

  /* Wait until the HSE is ready (or until a timeout elapsed) */

  for (timeout = HSERDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the HSERDY flag is the set in the CR */

      if ((getreg32(STM32H5_RCC_CR) & RCC_CR_HSERDY) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }
#else

#  error stm32h5_stdclockconfig(), must have one of STM32H5_BOARD_USEHSI, STM32H5_BOARD_USECSI, STM32H5_BOARD_USEHSE defined

#endif

  /* Check for a timeout.  If this timeout occurs, then we are hosed.  We
   * have no real back-up plan, although the following logic makes it look
   * as though we do.
   */

  if (timeout > 0)
    {
      /* Select main regulator voltage range according to system clock
       * frequency.
       */

      stm32h5_pwr_adjustvcore(STM32H5_SYSCLK_FREQUENCY);

      regval  = getreg32(STM32H5_RCC_CFGR2);
      /* Set the HCLK source/divider */

      regval &= ~RCC_CFGR2_HPRE_MASK;
      regval |= STM32H5_RCC_CFGR2_HPRE;

      /* Set the PCLK1 divider */

      regval &= ~RCC_CFGR2_PPRE1_MASK;
      regval |= STM32H5_RCC_CFGR2_PPRE1;

      /* Set the PCLK2 divider */

      regval &= ~RCC_CFGR2_PPRE2_MASK;
      regval |= STM32H5_RCC_CFGR2_PPRE2;

      /* Set the PCLK3 divider */

      regval &= ~RCC_CFGR2_PPRE3_MASK;
      regval |= STM32H5_RCC_CFGR2_PPRE3;

      putreg32(regval, STM32H5_RCC_CFGR2);


#ifdef CONFIG_STM32H5_RTC_HSECLOCK
      /* Set the RTC clock divisor */

      regval  = getreg32(STM32H5_RCC_CFGR1);
      regval &= ~RCC_CFGR1_RTCPRE_MASK;
      regval |= RCC_CFGR1_RTCPRE(HSE_DIVISOR);
      putreg32(regval, STM32H5_RCC_CFGR1);
#endif

      /* Configure PLL1 */

      /* PLL1CFGR */

      regval  = getreg32(STM32H5_RCC_PLL1CFGR);
      
      /* Set the PLL1 source and main divider */

/* Use PLL1SRC defnitions to override USE_XXX */

#ifdef STM32H5_PLL1SRC_HSI
      regval |= RCC_PLL1CFGR_PLL1SRC_HSI;
#elif defined(STM32H5_PLL1SRC_CSI)
      regval |= RCC_PLL1CFGR_PLL1SRC_CSI;
#elif defined(STM32H5_PLL1SRC_HSE)
      regval |= RCC_PLL1CFGR_PLL1SRC_HSE;
#elif defined(STM32H5_BOARD_USEHSI)
      regval |= RCC_PLL1CFGR_PLL1SRC_HSI;
#elif defined(STM32H5_BOARD_USECSI)
      regval |= RCC_PLL1CFGR_PLL1SRC_CSI;
#else /* if STM32H5_BOARD_USEHSE */
      regval |= RCC_PLL1CFGR_PLL1SRC_HSE;
#endif
     
      /* Set RGE, FRACEN, VCOSEL, and M from board.h */

      regval |= (STM32H5_PLL1CFGR_PLL1RGE | STM32H5_PLL1CFGR_PLL1FRACEN | 
		             STM32H5_PLL1CFGR_PLL1VCOSEL | STM32H5_PLL1CFGR_PLL1M);

#ifdef STM32H5_PLL1CFGR_PLL1P_ENABLED
      regval |= RCC_PLL1CFGR_PLL1PEN;
#endif
#ifdef STM32H5_PLL1CFGR_PLL1Q_ENABLED
      regval |= RCC_PLL1CFGR_PLL1QEN;
#endif
#ifdef STM32H5_PLL1CFGR_PLL1R_ENABLED
      regval |= RCC_PLL1CFGR_PLL1REN;
#endif
      
      putreg32(regval, STM32H5_RCC_PLL1CFGR);

      /* PLL1DIVR and PLL1FRACR */
      
      /* Get settings from board.h */
     
      /* PLL1DIVR */

      regval  = getreg32(STM32H5_RCC_PLL1DIVR);
      regval = (STM32H5_PLL1DIVR_PLL1N | STM32H5_PLL1DIVR_PLL1P | 
		            STM32H5_PLL1DIVR_PLL1Q | STM32H5_PLL1DIVR_PLL1R);
      putreg32(regval, STM32H5_RCC_PLL1DIVR);
      
      /* PLL1FRACR */

      regval  = getreg32(STM32H5_RCC_PLL1FRACR);
      regval |= STM32H5_PLL1FRACR_PLL1FRACN;
      putreg32(regval, STM32H5_RCC_PLL1FRACR);

      /* Enable PLL1 */

